Revit 2027 API
AssemblyMemberDifferentCategory.CategoryId1 Property
 Category id of the first assembly member
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId1 { get; }
Public ReadOnly Property CategoryId1 As ElementId
	Get
public:
property ElementId^ CategoryId1 {
	ElementId^ get ();
}
member CategoryId1 : ElementId with get
Property Value
ElementId
See Also
Reference
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace